Revit 2027 API
FabricationPart.InsulationType Property
 The insulation type of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string InsulationType { get; }
Public ReadOnly Property InsulationType As String
	Get
public:
property String^ InsulationType {
	String^ get ();
}
member InsulationType : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace